#+title:     40k DPS
#+author:    Logan Barnett-Hoy
#+email:     logustus@gmail.com
#+date:      <2021-06-26 Sat>
#+language:  en
#+file_tags:
#+tags:

Calculate the DPS (Damage Per Salvo) averages of a weapon to a given defense
profile in the grimdark table top war game Warhammer 40,000 by Games Workshop.

Data won't be provided here. Maybe at some point we can import data from the
same source that BattleScribe uses. For now, you have to do your own data entry
using data sources you legally purchased.

*** Running the computation

Here's an example using some Craftworld Aeldari weaponry against some Deathguard
units. Data tables are not included.

#+begin_src emacs-lisp
(require "40k-dps")
(append
  (wh40k/damage-probability-all-weapons-to-defender
                           "aeldari-weapon-profiles"
                           "defense-profiles"
                           "Pox walker")
  (wh40k/damage-probability-all-weapons-to-defender
                           "aeldari-weapon-profiles"
                           "defense-profiles"
                           "Deathshroud Terminator")
  (wh40k/damage-probability-all-weapons-to-defender
                           "aeldari-weapon-profiles"
                           "defense-profiles"
                           "Plagueburst Crawler")
  )
#+end_src

#+RESULTS:
| AML starshot                  | Pox walker             |    1.388888888888889 |
| AML sunburst                  | Pox walker             |   0.8333333333333334 |
| AML sunburst (full blast)     | Pox walker             |   1.6666666666666667 |
| Shuriken Pistol               | Pox walker             |   0.2777777777777778 |
| Shuriken Catapult             | Pox walker             |   0.5555555555555556 |
| Twin Linked Shuriken Catapult | Pox walker             |   1.1111111111111112 |
| Scatter Laser                 | Pox walker             |   1.4814814814814814 |
| Twin Linked Scatter Laser     | Pox walker             |    2.962962962962963 |
| Shuriken Cannon               | Pox walker             |   1.1111111111111112 |
| Twin Linked Shuriken Cannon   | Pox walker             |   2.2222222222222223 |
| Ghostspear                    | Pox walker             |    8.333333333333334 |
| Ghostglaive                   | Pox walker             |    5.555555555555556 |
| Wraithbone Fists              | Pox walker             |    4.444444444444445 |
| Titanic Wraithbone Feet       | Pox walker             |    8.333333333333334 |
| Titanic Wraithbone Fists      | Pox walker             |    5.555555555555556 |
| Titanic Ghostglaive           | Pox walker             |   11.111111111111112 |
| AML starshot                  | Deathshroud Terminator |   0.5185185185185185 |
| AML sunburst                  | Deathshroud Terminator |   0.2222222222222222 |
| AML sunburst (full blast)     | Deathshroud Terminator |   0.4444444444444444 |
| Shuriken Pistol               | Deathshroud Terminator | 0.037037037037037035 |
| Shuriken Catapult             | Deathshroud Terminator |  0.07407407407407407 |
| Twin Linked Shuriken Catapult | Deathshroud Terminator |  0.14814814814814814 |
| Scatter Laser                 | Deathshroud Terminator |   0.2962962962962963 |
| Twin Linked Scatter Laser     | Deathshroud Terminator |   0.5925925925925926 |
| Shuriken Cannon               | Deathshroud Terminator |   0.2222222222222222 |
| Twin Linked Shuriken Cannon   | Deathshroud Terminator |   0.4444444444444444 |
| Ghostspear                    | Deathshroud Terminator |   3.8888888888888893 |
| Ghostglaive                   | Deathshroud Terminator |    2.074074074074074 |
| Wraithbone Fists              | Deathshroud Terminator |   1.7777777777777777 |
| Titanic Wraithbone Feet       | Deathshroud Terminator |   3.5555555555555554 |
| Titanic Wraithbone Fists      | Deathshroud Terminator |    2.074074074074074 |
| Titanic Ghostglaive           | Deathshroud Terminator |    5.555555555555555 |
| AML starshot                  | Plagueburst Crawler    |   0.5185185185185185 |
| AML sunburst                  | Plagueburst Crawler    |  0.16666666666666666 |
| AML sunburst (full blast)     | Plagueburst Crawler    |   0.3333333333333333 |
| Shuriken Pistol               | Plagueburst Crawler    | 0.037037037037037035 |
| Shuriken Catapult             | Plagueburst Crawler    |  0.07407407407407407 |
| Twin Linked Shuriken Catapult | Plagueburst Crawler    |  0.14814814814814814 |
| Scatter Laser                 | Plagueburst Crawler    |   0.2962962962962963 |
| Twin Linked Scatter Laser     | Plagueburst Crawler    |   0.5925925925925926 |
| Shuriken Cannon               | Plagueburst Crawler    |   0.2222222222222222 |
| Twin Linked Shuriken Cannon   | Plagueburst Crawler    |   0.4444444444444444 |
| Ghostspear                    | Plagueburst Crawler    |    4.148148148148148 |
| Ghostglaive                   | Plagueburst Crawler    |    2.765432098765432 |
| Wraithbone Fists              | Plagueburst Crawler    |   1.1851851851851851 |
| Titanic Wraithbone Feet       | Plagueburst Crawler    |   3.5555555555555554 |
| Titanic Wraithbone Fists      | Plagueburst Crawler    |    2.074074074074074 |
| Titanic Ghostglaive           | Plagueburst Crawler    |   7.4074074074074066 |

